Tekla.Structures.Model.ContourPlate
The ContourPlate class represents a part made with a contour, such as, a concrete slab.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
ContourPoint point =  new ContourPoint(new Point(   0, 4000, 0), null);
ContourPoint point2 = new ContourPoint(new Point(2000, 4000, 0), null);
ContourPoint point3 = new ContourPoint(new Point(   0, 6000, 0), null);
ContourPlate CP = new ContourPlate();
CP.AddContourPoint(point);
CP.AddContourPoint(point2);
CP.AddContourPoint(point3);
CP.Finish = "FOO";
CP.Profile.ProfileString = "PL200";
CP.Material.MaterialString = "K30-2";
bool Result = false;
Result = CP.Insert();
}
}